In [11]:
import pandas as pd
import numpy as np

## HTML IO - Taking Inputs as tables from a HTML

In [2]:
url = "https://en.wikipedia.org/wiki/World_population"

In [3]:
tables = pd.read_html(url)

In [4]:
len(tables)

25

In [5]:
top_ten = tables[0]

In [6]:
top_ten

,#,Most populous countries,2000,2015,2030[A]
0,1,China[B],1270,1376,1416
1,2,India,1053,1311,1528
2,3,United States,283,322,356
3,4,Indonesia,212,258,295
4,5,Pakistan,136,208,245
5,6,Brazil,176,206,228
6,7,Nigeria,123,182,263
7,8,Bangladesh,131,161,186
8,9,Russia,146,146,149
9,10,Mexico,103,127,148
10,NaN,World total,6127,7349,8501
11,Notes: .mw-parser-output .reflist{font-size:90...,Notes: .mw-parser-output .reflist{font-size:90...,Notes: .mw-parser-output .reflist{font-size:90...,Notes: .mw-parser-output .reflist{font-size:90...,Notes: .mw-parser-output .reflist{font-size:90...

In [7]:
top_ten.columns=['countries',2000,2015,2030]

ValueError: Length mismatch: Expected axis has 5 elements, new values have 4 elements

In [ ]:
top_ten

## Excel IO

In [ ]:
import pandas as pd

In [ ]:
 df = pd.read_excel('..\\03-Pandas\\my_excel_file.xlsx',sheet_name='First_Sheet')

In [ ]:
df

## IO using SQL

In [16]:
from sqlalchemy import create_engine

In [17]:
temp_db=create_engine('sqlite:///:memory:')

In [18]:
df =pd.DataFrame(data =np.random.randint(0,100,size=(4,4)),columns=['a','b','c','d'])

In [19]:
df

    a   b   c   d
0  13  86  80   0
1  60  88  98  94
2  74  53   6  26
3  71  60  75  27

In [23]:
pd.read_sql(sql='new_table',con=temp_db)

   index   a   b   c   d
0      0  13  86  80   0
1      1  60  88  98  94
2      2  74  53   6  26
3      3  71  60  75  27

In [26]:
pd.read_sql(sql="SELECT a,c from new_table where a=60",con=temp_db)

    a   c
0  60  98